In [1]:
import pandas as pd

In [3]:
df = pd.read_excel(r"C:\Users\kayna\Downloads\Ecomm.xlsx")

In [11]:
df.shape

(24, 12)

In [12]:
df

,CustomerID,CustomerID.1,Order Date,Month,MonthName,DateInText,Customer Name,State or Province,City,Gender,Gender.1,Gender.2
0,CUS7253,7253,2015-01-07,1,Jan,01/07/2015,Bonnie Potter,Washington,Anacortes,M,1,MALE
1,CUS4875,4875,2015-06-13,6,Jun,06/13/2015,Ronnie Proctor,California,San Gabriel,F,0,FEMALE
2,CUS2748,2748,2015-02-15,2,Feb,02/15/2015,Marcus Dunlap,New Jersey,Roselle,M,1,MALE
3,CUS4565,4565,2015-05-12,5,May,05/12/2015,Gwendolyn F Tyson,Minnesota,Prior Lake,M,1,MALE
4,CUS4666,4666,2015-05-12,5,May,05/12/2015,Gwendolyn F Tyson,Minnesota,Prior Lake,M,1,MALE
5,CUS4663,4663,2015-05-12,5,May,05/12/2015,Gwendolyn F Tyson,Minnesota,Prior Lake,F,0,FEMALE
6,CUS2583,2583,2015-05-12,5,May,05/12/2015,Gwendolyn F Tyson,Minnesota,Prior Lake,M,1,MALE
7,CUS8372,8372,2015-04-08,4,Apr,04/08/2015,Timothy Reese,New York,Smithtown,M,1,MALE
8,CUS6458,6458,2015-05-28,5,May,05/28/2015,Timothy Reese,New York,Smithtown,M,1,MALE
9,CUS2834,2834,2015-02-12,2,Feb,02/12/2015,Sarah Ramsey,New York,Syracuse,F,0,FEMALE
10,CUS8264,8264,2015-02-12,2,Feb,02/12/2015,Sarah Ramsey,New York,Syracuse,M,1,MALE
11,CUS8363,8363,2015-05-15,5,May,05/15/2015,Laurie Hanna,Montana,Helena,M,1,MALE
12,CUS4556,4556,2015-05-21,5,May,05/21/2015,Jim Rodgers,Montana,Missoula,M,1,MALE
13,CUS5243,5243,2015-05-15,5,May,05/15/2015,Tony Wilkins Winters,New York,New York City,F,0,FEMALE
14,CUS5654,5654,2015-05-21,5,May,05/21/2015,Tony Wilkins Winters,New York,New York City,M,1,MALE
15,CUS2357,2357,2015-05-21,5,May,05/21/2015,Tony Wilkins Winters,New York,New York City,M,1,MALE
16,CUS7876,7876,2015-01-28,1,Jan,01/28/2015,Edna Thomas,California,Laguna Niguel,M,1,MALE
17,CUS5265,5265,2015-01-28,1,Jan,01/28/2015,Edna Thomas,California,Laguna Niguel,F,0,FEMALE
18,CUS1573,1573,2015-05-02,5,May,05/02/2015,Guy Gallagher,California,Lakewood,M,1,MALE
19,CUS7356,7356,2015-02-22,2,Feb,02/22/2015,Matthew Berman,Oregon,Grants Pass,M,1,MALE
20,CUS3445,3445,2015-03-27,3,Mar,03/27/2015,Matthew Berman,Oregon,Grants Pass,M,1,MALE
21,CUS6735,6735,2015-01-20,1,Jan,01/20/2015,Matthew Berman,Oregon,Grants Pass,F,0,FEMALE
22,CUS8845,8845,2015-03-12,3,Mar,03/12/2015,Matthew Berman,Oregon,Grants Pass,M,1,MALE
23,CUS4568,4568,2015-06-15,6,Jun,06/15/2015,Ricky Hensley,Oregon,Gresham,M,1,MALE

In [13]:
# This excel file has 2 sheets 1. jan , 2. CustomerDetail

In [17]:
customer = pd.read_excel(r"C:\Users\kayna\Downloads\Ecomm.xlsx" , sheet_name='CustomerDetail')

In [19]:
customer.head(2)

,CustomerID,CustomerID.1,Order Date,Month,MonthName,DateInText,Customer Name,State or Province,City,Gender,Gender.1,Gender.2
0,CUS7253,7253,2015-01-07,1,Jan,01/07/2015,Bonnie Potter,Washington,Anacortes,M,1,MALE
1,CUS4875,4875,2015-06-13,6,Jun,06/13/2015,Ronnie Proctor,California,San Gabriel,F,0,FEMALE

In [22]:
orders = pd.read_excel(r"C:\Users\kayna\Downloads\Ecomm.xlsx" , sheet_name='Jan')

In [23]:
orders.head(2)

,Order ID,CustomerID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,88522,4666,11.36,4.5600,4,Office Supplies,Pens & Art Supplies,Credit Card
1,90193,4663,6011.76,4390.3665,12,Furniture,Chairs & Chairmats,Credit Card

In [34]:
# checking for cleaning process
# cleaning the customer dataset
customer.isnull().sum()

CustomerID.1         0
Order Date           0
Customer Name        0
State or Province    0
City                 0
Gender               0
dtype: int64

In [27]:
customer.head(2)

,CustomerID,CustomerID.1,Order Date,Month,MonthName,DateInText,Customer Name,State or Province,City,Gender,Gender.1,Gender.2
0,CUS7253,7253,2015-01-07,1,Jan,01/07/2015,Bonnie Potter,Washington,Anacortes,M,1,MALE
1,CUS4875,4875,2015-06-13,6,Jun,06/13/2015,Ronnie Proctor,California,San Gabriel,F,0,FEMALE

In [28]:
customer.columns

Index(['CustomerID', 'CustomerID.1', 'Order Date', 'Month', 'MonthName',
       'DateInText', 'Customer Name', 'State or Province', 'City', 'Gender',
       'Gender.1', 'Gender.2'],
      dtype='object')

In [29]:
customer = customer.drop(columns=['CustomerID','Month', 'MonthName','DateInText','Gender.1', 'Gender.2'])

In [30]:
customer.head(2)

,CustomerID.1,Order Date,Customer Name,State or Province,City,Gender
0,7253,2015-01-07,Bonnie Potter,Washington,Anacortes,M
1,4875,2015-06-13,Ronnie Proctor,California,San Gabriel,F

In [31]:
customer.shape

(24, 6)

In [32]:
# cleaning orders dataset

In [33]:
orders.head(2)

,Order ID,CustomerID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,88522,4666,11.36,4.5600,4,Office Supplies,Pens & Art Supplies,Credit Card
1,90193,4663,6011.76,4390.3665,12,Furniture,Chairs & Chairmats,Credit Card

In [37]:
orders.columns

Index(['Order ID', 'CustomerID', 'Amount', 'Profit', 'Quantity ordered new',
       'Product Category', 'Product Sub-Category', 'Payment Mode'],
      dtype='object')

In [36]:
orders.isnull().sum()

Order ID                0
CustomerID              0
Amount                  0
Profit                  0
Quantity ordered new    0
Product Category        0
Product Sub-Category    0
Payment Mode            0
dtype: int64

In [39]:
orders = orders.drop(columns=['Order ID'])

In [40]:
orders.head(2)

,CustomerID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,4666,11.36,4.5600,4,Office Supplies,Pens & Art Supplies,Credit Card
1,4663,6011.76,4390.3665,12,Furniture,Chairs & Chairmats,Credit Card

In [41]:
orders.shape

(1952, 7)

In [42]:
# Groups by functions

In [43]:
orders['Product Category'].unique()

array(['Office Supplies', 'Furniture', 'Technology'], dtype=object)

In [46]:
print("Total Profit:",round( orders['Profit'].sum(),2),"INR")

Total Profit: 224114.64 INR

In [50]:
orders.groupby(['Product Category']).agg({'Profit':'sum'}) # agg means aggregate (aur agg mei sum,avg,max,min sirf inhi ka use hota h)

                        Profit
Product Category
Furniture         59249.445936
Office Supplies   89562.039537
Technology        75303.156364

In [56]:
orders.groupby(['Product Category']).agg({'Profit':'sum'}).reset_index()

  Product Category        Profit
0        Furniture  59249.445936
1  Office Supplies  89562.039537
2       Technology  75303.156364

In [60]:
orders.groupby(['Product Sub-Category']).agg({'Profit':'sum'}).reset_index()

              Product Sub-Category        Profit
0                       Appliances  12594.820600
1   Binders and Binder Accessories  59296.389430
2                        Bookcases   -930.438400
3               Chairs & Chairmats  48695.836600
4             Computer Peripherals   1698.043980
5                  Copiers and Fax  23990.207580
6                        Envelopes  -1194.412500
7                           Labels   7028.159500
8               Office Furnishings  18724.119100
9                  Office Machines   8824.390564
10                           Paper   7769.315070
11             Pens & Art Supplies   -220.598800
12                    Rubber Bands  -1544.826063
13   Scissors, Rulers and Trimmers  -1291.095900
14          Storage & Organization   7124.288200
15                          Tables  -7240.071364
16    Telephones and Communication  40790.514240

In [61]:
orders.groupby(['Product Category','Product Sub-Category']).agg({'Profit':'sum'}).reset_index()

   Product Category            Product Sub-Category        Profit
0         Furniture                       Bookcases   -930.438400
1         Furniture              Chairs & Chairmats  48695.836600
2         Furniture              Office Furnishings  18724.119100
3         Furniture                          Tables  -7240.071364
4   Office Supplies                      Appliances  12594.820600
5   Office Supplies  Binders and Binder Accessories  59296.389430
6   Office Supplies                       Envelopes  -1194.412500
7   Office Supplies                          Labels   7028.159500
8   Office Supplies                           Paper   7769.315070
9   Office Supplies             Pens & Art Supplies   -220.598800
10  Office Supplies                    Rubber Bands  -1544.826063
11  Office Supplies   Scissors, Rulers and Trimmers  -1291.095900
12  Office Supplies          Storage & Organization   7124.288200
13       Technology            Computer Peripherals   1698.043980
14       Technology                 Copiers and Fax  23990.207580
15       Technology                 Office Machines   8824.390564
16       Technology    Telephones and Communication  40790.514240

In [62]:
# merging the both sheet

In [63]:
customer.head(2)

,CustomerID.1,Order Date,Customer Name,State or Province,City,Gender
0,7253,2015-01-07,Bonnie Potter,Washington,Anacortes,M
1,4875,2015-06-13,Ronnie Proctor,California,San Gabriel,F

In [64]:
orders.head(2)

,CustomerID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,4666,11.36,4.5600,4,Office Supplies,Pens & Art Supplies,Credit Card
1,4663,6011.76,4390.3665,12,Furniture,Chairs & Chairmats,Credit Card

In [67]:
len(customer['CustomerID.1']) ,len(customer['CustomerID.1'].unique())

(24, 24)

In [68]:
# we have all unique customers in customer dataset

In [69]:
# Renaming a column  name

In [70]:
customer=customer.rename(columns={'CustomerID.1':'CustomerID'})

In [72]:
customer.head(2)

   CustomerID Order Date   Customer Name State or Province         City Gender
0        7253 2015-01-07   Bonnie Potter        Washington    Anacortes      M
1        4875 2015-06-13  Ronnie Proctor        California  San Gabriel      F

In [74]:
# we are merging customer and orders data together
df = pd.merge(customer,orders,on='CustomerID')

In [75]:
df.shape

(1952, 12)

In [76]:
df.head(2)

,CustomerID,Order Date,Customer Name,State or Province,City,Gender,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,4666,2015-05-12,Gwendolyn F Tyson,Minnesota,Prior Lake,M,11.36,4.560,4,Office Supplies,Pens & Art Supplies,Credit Card
1,4666,2015-05-12,Gwendolyn F Tyson,Minnesota,Prior Lake,M,94.27,105.678,11,Office Supplies,"Scissors, Rulers and Trimmers",Credit Card

In [78]:
df.groupby(['State or Province']).agg({'Profit':'sum'}).reset_index()

  State or Province        Profit
0        California  31886.448316
1         Minnesota  34330.365504
2           Montana  15291.345669
3          New York  98143.568974
4            Oregon  44462.913374

In [79]:
df.isnull().sum()

CustomerID              0
Order Date              0
Customer Name           0
State or Province       0
City                    0
Gender                  0
Amount                  0
Profit                  0
Quantity ordered new    0
Product Category        0
Product Sub-Category    0
Payment Mode            0
dtype: int64